// 1. Напишите программу, которая на вход принимаетдва числа и проверяет,
// является ли первое число квадратом второго

Console.Write("Введите два целых числа: ");
int num_A = Convert.ToInt32(Console.ReadLine());
int num_B = Convert.ToInt32(Console.ReadLine());
if(num_A / num_B = num_B)
{
    Console,WriteLine($"Число {num_A} является квадратом числа {num_B}");
}
else
{
    Console,WriteLine($"Число {num_A} не является квадратом числа {num_B}");
}

