// 0. Демонстрация решения
// Написать программу, которая на вход принимает число и выдаёт его квадрат

Console.WriteLine("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());
int square = num * num;
Console.WriteLine($"Квадрат числа {num} = {square}");
